
# 场馆类型
Map_CourtType = {
    1: '足球',
    2: '篮球',
    3: '健身房',
    4: '游泳',
    5: '乒乓球',
    6: '羽毛球',
    7: '台球',
    8: '排球',
    9: '高尔夫球',
    10: '舞蹈',
    11: '武术',
    12: '保龄球',
    13: '壁球',
    14: '格斗',
    15: '滑冰',
    16: '绘画',
    17: '击剑',
    18: '健美操',
    19: '田径',
    20: '网球',
    21: '攀岩',
    22: '散打',
    23: '射击',
    24: '摔跤',
    25: '体操',
    26: '体育舞蹈',
    27: '综合操房'
}

# 场馆设施类型
Map_Facility = {
    1: '停车场',
    2: '光纤',
    3: '更衣室',
    4: '浴室',
    5: '商品部',
    6: '新风系统',
    7: '中央空调',
    8: '厕所',
    9: 'WIFI',
}

# 场馆类型标签颜色、字体颜色
Map_CourtTypeColor={
  0:['#cce6ff','#0581fe'],#蓝
  1:['#caffd7','#34c758'],#绿
  2:['#e6fffb','#36cfc9'],#青
  3:['#feffe6','#fadb14'],#黄
  4:['#fff7e6','#ffa940'],#橙
}
